Repository: tripping-alien/shortlink
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ar, de, fr, he, ja, nl, ru

source: Private & Easy Link Shortener | Bijective-Shorty
ar: مختصِر روابط خاص وسهل | Bijective-Shorty
de: Privater & Einfacher Link-Kürzer | Bijective-Shorty
fr: Raccourcisseur de Liens Privé & Simple | Bijective-Shorty
ja: プライベート＆簡単リンク短縮 | Bijective-Shorty
ru: Приватный и простой сокращатель ссылок | Bijective-Shorty

source: A private and easy link shortener to create temporary, secure, and simple short URLs. Fast, free, and respects your privacy. | Приватный и простой сокращатель ссылок.
ar: مختصِر روابط خاص وسهل لإنشاء عناوين URL قصيرة ومؤقتة وآمنة وبسيطة. سريع ومجاني ويحترم خصوصيتك.
de: Ein privater und einfacher Link-Kürzer zum Erstellen temporärer, sicherer und einfacher Kurz-URLs. Schnell, kostenlos und respektiert Ihre Privatsphäre.
fr: Un raccourcisseur de liens privé et simple pour créer des URL courtes, temporaires, sécurisées et simples. Rapide, gratuit et respecte votre vie privée.
he: מקצר קישורים פרטי וקל ליצירת כתובות URL קצרות, זמניות, מאובטחות ופשוטות. מהיר, חינמי ומכבד את פרטיותך.
ja: 一時的で安全、シンプルな短縮URLを作成するための、プライベートで簡単なリンク短縮サービス。高速、無料で、プライバシーを尊重します。
nl: Een privé en eenvoudige linkverkorter om tijdelijke, veilige en simpele korte URL's te maken. Snel, gratis en respecteert uw privacy.
ru: Приватный и простой сокращатель ссылок для создания временных, безопасных и простых коротких URL. Быстро, бесплатно и с уважением к вашей конфиденциальности.

source: A Private and Easy Link Shortener
ar: مختصِر روابط خاص وسهل
de: Ein Privater und Einfacher Link-Kürzer
fr: Un Raccourcisseur de Liens Privé et Simple
he: מקצר קישורים פרטי וקל
ja: プライベートで簡単なリンク短縮
nl: Een Privé en Eenvoudige Link Verkorter
ru: Приватный и простой сокращатель ссылок

source: Enter a long URL to shorten...
ar: أدخل عنوان URL طويلاً لتقصيره...
de: Lange URL zum Kürzen eingeben...
fr: Entrez une URL longue à raccourcir...
he: הזן כתובת URL ארוכה לקיצור...
ja: 短縮する長いURLを入力...
nl: Voer een lange URL in om te verkorten...
ru: Введите длинный URL для сокращения...

source: Shorten
ar: تقصير
de: Kürzen
fr: Raccourcir
he: קצר
ja: 短縮
nl: Verkorten
ru: Сократить

source: Verification
ar: التحقق
de: Verifizierung
fr: Vérification
he: אימות
ja: 認証
nl: Verificatie
ru: Проверка

source: Answer
ar: الإجابة
de: Antwort
fr: Réponse
he: תשובה
ja: 回答
nl: Antwoord
ru: Ответ

source: Link expires in:
ar: تنتهي صلاحية الرابط خلال:
de: Link läuft ab in:
fr: Le lien expire dans :
he: הקישור יפוג בעוד:
ja: リンクの有効期限:
nl: Link vervalt over:
ru: Ссылка истекает через:

source: 1 Hour
ar: ساعة واحدة
de: 1 Stunde
fr: 1 heure
he: שעה
ja: 1時間
nl: 1 uur
ru: 1 час

source: 24 Hours
ar: 24 ساعة
de: 24 Stunden
fr: 24 heures
he: 24 שעות
ja: 24時間
nl: 24 uur
ru: 24 часа

source: 1 Week
ar: أسبوع واحد
de: 1 Woche
fr: 1 semaine
he: שבוע
ja: 1週間
ru: 1 неделя

source: Never
ar: أبدًا
de: Niemals
fr: Jamais
he: לעולם לא
ja: 無期限
nl: Nooit
ru: Никогда

source: Your short link:
ar: رابطك المختصر:
de: Ihr Kurzlink:
fr: Votre lien court :
he: הקישור המקוצר שלך:
ja: あなたの短縮リンク:
nl: Uw korte link:
ru: Ваша короткая ссылка:

source: Copy
ar: نسخ
de: Kopieren
fr: Copier
he: העתק
ja: コピー
nl: Kopiëren
ru: Копировать

source: Copied!
ar: تم النسخ!
de: Kopiert!
fr: Copié !
he: הועתק!
ja: コピーしました！
nl: Gekopieerd!
ru: Скопировано!

source: Crafted by
ar: صُنع بواسطة
de: Erstellt von
fr: Créé par
he: נוצר על ידי
ja: 作成者
nl: Gemaakt door
ru: Создано

source: View on
ar: عرض على
de: Ansehen auf
fr: Voir sur
he: צפה ב
ja: で表示
nl: Bekijk op
ru: Смотреть на

source: Released under the
ar: صدر تحت
de: Veröffentlicht unter der
fr: Publié sous la
he: שוחרר תחת
ja: ライセンス
nl: Uitgebracht onder de
ru: Выпущено под

source: Invalid short code format
ar: تنسيق الرمز المختصر غير صالح
de: Ungültiges Kurzcode-Format
fr: Format de code court invalide
he: פורמט קוד קצר לא תקין
ja: 無効なショートコード形式です
nl: Ongeldig formaat korte code
ru: Неверный формат короткого кода

source: Short link not found
ar: الرابط المختصر غير موجود
de: Kurzlink nicht gefunden
fr: Lien court non trouvé
he: קישור קצר לא נמצא
ja: 短縮リンクが見つかりません
nl: Korte link niet gevonden
ru: Короткая ссылка не найдена

source: Short link has expired
ar: انتهت صلاحية الرابط المختصر
de: Kurzlink ist abgelaufen
fr: Le lien court a expiré
he: הקישור הקצר פג תוקף
ja: 短縮リンクの有効期限が切れています
nl: Korte link is verlopen
ru: Срок действия короткой ссылки истек

source: Your link is private and will automatically expire in {duration}.
ar: رابطك خاص وسينتهي صلاحيته تلقائيًا خلال {duration}.
de: Ihr Link ist privat und läuft automatisch in {duration} ab.
fr: Votre lien est privé et expirera automatiquement dans {duration}.
he: הקישור שלך פרטי ויפוג באופן אוטומטי תוך {duration}.
ja: リンクはプライベートで、{duration}後に自動的に失効します。
nl: Uw link is privé en vervalt automatisch over {duration}.
ru: Ваша ссылка приватна и автоматически истечет через {duration}.

source: Your link is private and will never expire.
ar: رابطك خاص ولن تنتهي صلاحيته أبدًا.
de: Ihr Link ist privat und wird niemals ablaufen.
fr: Votre lien est privé et n'expirera jamais.
he: הקישור שלך פרטי ולעולם לא יפוג.
ja: リンクはプライベートで、失効することはありません。
nl: Uw link is privé en zal nooit vervallen.
ru: Ваша ссылка приватна и никогда не истечет.

source: About
ar: حول
de: Über
fr: À propos
he: אודות
ja: 概要
nl: Over
ru: О проекте

source: About Bijective-Shorty
ar: حول Bijective-Shorty
de: Über Bijective-Shorty
fr: À propos de Bijective-Shorty
ja: Bijective-Shortyについて
ru: О Bijective-Shorty

source: This project is a high-performance, privacy-focused URL shortener built with FastAPI and a pure Python technology stack.
ar: هذا المشروع هو أداة تقصير روابط عالية الأداء تركز على الخصوصية، مبنية باستخدام FastAPI ومكدس تقنيات بايثون خالص.
de: Dieses Projekt ist ein leistungsstarker, datenschutzorientierter URL-Kürzer, der mit FastAPI und einem reinen Python-Technologie-Stack erstellt wurde.
fr: Ce projet est un raccourcisseur d'URL haute performance, axé sur la confidentialité, construit avec FastAPI et une pile technologique purement Python.
he: פרויקט זה הוא מקצר קישורים בעל ביצועים גבוהים, המתמקד בפרטיות, ובנוי באמצעות FastAPI וערימת טכנולוגיות פייתון טהורה.
ja: このプロジェクトは、FastAPIと純粋なPython技術スタックで構築された、高性能でプライバシーを重視したURL短縮サービスです。
nl: Dit project is een high-performance, op privacy gerichte URL-verkorter, gebouwd met FastAPI en een pure Python-technologiestack.
ru: Этот проект — высокопроизводительный и ориентированный на конфиденциальность сокращатель URL-адресов, созданный с использованием FastAPI и чистого стека технологий Python.

source: It uses a bijective function to convert database IDs into short, non-sequential, and predictable base-6 codes. This method is efficient and avoids the database collisions common in hash-based shorteners.
ar: يستخدم دالة تقابلية لتحويل معرفات قاعدة البيانات إلى رموز قصيرة وغير متسلسلة وقابلة للتنبؤ بنظام العد السداسي. هذه الطريقة فعالة وتتجنب تصادمات قاعدة البيانات الشائعة في أدوات تقصير الروابط القائمة على التجزئة.
de: Es verwendet eine bijektive Funktion, um Datenbank-IDs in kurze, nicht-sequenzielle und vorhersagbare Base-6-Codes umzuwandeln. Diese Methode ist effizient und vermeidet die Datenbankkollisionen, die bei hash-basierten Kürzern üblich sind.
fr: Il utilise une fonction bijective pour convertir les identifiants de la base de données en codes courts, non séquentiels et prévisibles en base 6. Cette méthode est efficace et évite les collisions de base de données courantes dans les raccourcisseurs basés sur le hachage.
ja: データベースIDを短く、非連続的で予測可能なBase-6コードに変換するために全単射関数を使用しています。この方法は効率的で、ハッシュベースの短縮サービスで一般的なデータベースの衝突を回避します。
ru: Он использует биективную функцию для преобразования идентификаторов базы данных в короткие, непоследовательные и предсказуемые коды в шестеричной системе счисления. Этот метод эффективен и позволяет избежать коллизий в базе данных, характерных для сокращателей на основе хеширования.

source: Core Features
ar: الميزات الأساسية
de: Kernfunktionen
fr: Fonctionnalités Clés
he: תכונות עיקריות
ja: 主な機能
nl: Kernfuncties
ru: Ключевые особенности

source: Stateless & Fast
ar: بدون حالة وسريع
de: Zustandslos & Schnell
fr: Sans état et Rapide
he: ללא מצב ומהיר
ja: ステートレス＆高速
nl: Stateless & Snel
ru: Без состояния и быстрый

source: Generates short codes mathematically without needing to check for pre-existing hashes.
ar: يولد رموزًا قصيرة رياضيًا دون الحاجة إلى التحقق من وجود تجزئات مسبقة.
de: Erzeugt mathematisch kurze Codes, ohne auf bereits vorhandene Hashes prüfen zu müssen.
fr: Génère des codes courts mathématiquement sans avoir besoin de vérifier les hachages préexistants.
he: יוצר קודים קצרים באופן מתמטי ללא צורך לבדוק קיום של גיבובים קודמים.
ja: 既存のハッシュをチェックする必要なく、数学的にショートコードを生成します。
nl: Genereert wiskundig korte codes zonder de noodzaak om reeds bestaande hashes te controleren.
ru: Генерирует короткие коды математически, без необходимости проверять наличие существующих хешей.

source: Privacy-Focused
ar: يركز على الخصوصية
de: Datenschutzorientiert
fr: Axé sur la Confidentialité
he: ממוקד פרטיות
ja: プライバシー重視
nl: Privacygericht
ru: Ориентирован на приватность

source: No tracking, no analytics. Just simple, fast redirects.
ar: لا تتبع، لا تحليلات. مجرد عمليات إعادة توجيه بسيطة وسريعة.
de: Kein Tracking, keine Analysen. Nur einfache, schnelle Weiterleitungen.
fr: Pas de suivi, pas d'analyses. Juste des redirections simples et rapides.
he: אין מעקב, אין ניתוחים. רק הפניות פשוטות ומהירות.
ja: 追跡なし、分析なし。シンプルで高速なリダイレクトのみ。
nl: Geen tracking, geen analyses. Alleen eenvoudige, snelle omleidingen.
ru: Без отслеживания, без аналитики. Только простые и быстрые перенаправления.

source: Temporary Links
ar: روابط مؤقتة
de: Temporäre Links
fr: Liens Temporaires
he: קישורים זמניים
ja: 一時的なリンク
nl: Tijdelijke Links
ru: Временные ссылки

source: Set an expiration time for your links, from one hour to one week, or never.
ar: قم بتعيين وقت انتهاء صلاحية لروابطك، من ساعة واحدة إلى أسبوع واحد، أو أبداً.
de: Legen Sie eine Ablaufzeit für Ihre Links fest, von einer Stunde bis zu einer Woche, oder niemals.
fr: Définissez une durée d'expiration pour vos liens, d'une heure à une semaine, ou jamais.
he: הגדר זמן תפוגה לקישורים שלך, משעה אחת ועד שבוע, או לעולם לא.
ja: リンクの有効期限を1時間から1週間、または無期限に設定できます。
nl: Stel een vervaltijd in voor uw links, van een uur tot een week, of nooit.
ru: Установите время истечения срока действия для ваших ссылок: от одного часа до одной недели или никогда.

source: Internationalized
ar: مدعوم دوليًا
de: Internationalisiert
fr: Internationalisé
he: בינלאומי
ja: 国際化対応
nl: Geïnternationaliseerd
ru: Интернационализация

source: The UI is available in multiple languages.
ar: واجهة المستخدم متاحة بلغات متعددة.
de: Die Benutzeroberfläche ist in mehreren Sprachen verfügbar.
fr: L'interface utilisateur est disponible en plusieurs langues.
he: ממשק המשתמש זמין במספר שפות.
ja: UIは複数の言語で利用可能です。
nl: De UI is beschikbaar in meerdere talen.
ru: Интерфейс доступен на нескольких языках.

source: Back to Home
ar: العودة إلى الرئيسية
de: Zurück zur Startseite
fr: Retour à l'accueil
he: חזרה לדף הבית
ja: ホームに戻る
nl: Terug naar Start
ru: Вернуться на главную

source: private link shortener, easy link shortener, secure url shortener, temporary url, free link shortener, custom url, short url, anonymous link shortener
de: privater link-kürzer, einfacher link-kürzer, sicherer url-kürzer, temporäre url, kostenloser link-kürzer, benutzerdefinierte url, kurze url, anonymer link-kürzer
he: מקצר קישורים פרטי, מקצר קישורים קל, מקצר url מאובטח, קישור זמני, מקצר קישורים חינמי, כתובת url מותאמת אישית, url קצר, מקצר קישורים אנונימי
ja: プライベートリンク短縮, 簡単リンク短縮, 安全なURL短縮, 一時的なURL, 無料リンク短縮, カスタムURL, 短縮URL, 匿名リンク短縮
nl: privé link verkorter, makkelijke link verkorter, veilige url verkorter, tijdelijke url, gratis link verkorter, aangepaste url, korte url, anonieme link verkorter
ru: приватный сокращатель ссылок, простой сокращатель ссылок, безопасный сокращатель url, временная ссылка, бесплатный сокращатель ссылок, кастомный url, короткий url, анонимный сокращатель ссылок

source: Private & Easy Link Shortener | Shortlink
he: מקצר קישורים פרטי וקל | Shortlink
nl: Privé & Eenvoudige Link Verkorter | Shortlink

source: About Shortlink
he: אודות Shortlink
nl: Over Shortlink

source: It uses the Hashids library to convert sequential database IDs into short, non-sequential, and unique codes. This method is efficient and provides obfuscation for your links.
he: הוא משתמש בספריית Hashids כדי להמיר מזהי מסד נתונים סדרתיים לקודים קצרים, לא עוקבים וייחודיים. שיטה זו יעילה ומספקת ערפול לקישורים שלך.
nl: Het gebruikt de Hashids-bibliotheek om sequentiële database-ID's om te zetten in korte, niet-sequentiële en unieke codes. Deze methode is efficiënt en zorgt voor versluiering van uw links.
